# Day 1 Session 2

In [10]:
import numpy as np
import pandas as pd

In [15]:
data=list(range(10,80,10))
data=pd.Series(data)
print(type(data))
data

<class 'pandas.core.series.Series'>

0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64

In [16]:
a={'a': 10, 'b': 20, 'c': 30, 'd': 40 }
a=pd.Series(a)
a

a    10
b    20
c    30
d    40
dtype: int64

In [32]:
ser1=pd.Series([100, 200, 300, 400], ["India", "Ostia", "Hellas Empire", "Maglaosandria"])
ser1

India            100
Ostia            200
Hellas Empire    300
Maglaosandria    400
dtype: int64

In [35]:
ser2=pd.Series(["India", "Ostia", "Hellas Empire", "Maglaosandria"], [100, 200, 300, 400])
ser2

100            India
200            Ostia
300    Hellas Empire
400    Maglaosandria
dtype: object

In [36]:
ser1+ser2

100              NaN
200              NaN
300              NaN
400              NaN
Hellas Empire    NaN
India            NaN
Maglaosandria    NaN
Ostia            NaN
dtype: object

In [45]:
d={'name':['Manish', 'Ankit', 'Fate', 'Tertium'], 'CQCP':[1000, 2000, 9999, 9000]}
d=pd.DataFrame(d, index=['Ace', 'Sec', 'Tertium', 'Quartium'])
print(type(d))
d

<class 'pandas.core.frame.DataFrame'>

             name  CQCP
Ace        Manish  1000
Sec         Ankit  2000
Tertium      Fate  9999
Quartium  Tertium  9000

In [46]:
print(type(d['name']))
d['name']

<class 'pandas.core.series.Series'>

Ace          Manish
Sec           Ankit
Tertium        Fate
Quartium    Tertium
Name: name, dtype: object

In [77]:
np.random.seed(10)
df=pd.DataFrame(np.random.randn(10,4),columns=['a', 'b', 'c', 'd'])
df

          a         b         c         d
0  1.331587  0.715279 -1.545400 -0.008384
1  0.621336 -0.720086  0.265512  0.108549
2  0.004291 -0.174600  0.433026  1.203037
3 -0.965066  1.028274  0.228630  0.445138
4 -1.136602  0.135137  1.484537 -1.079805
5 -1.977728 -1.743372  0.266070  2.384967
6  1.123691  1.672622  0.099149  1.397996
7 -0.271248  0.613204 -0.267317 -0.549309
8  0.132708 -0.476142  1.308473  0.195013
9  0.400210 -0.337632  1.256472 -0.731970

In [78]:
df.shape

(10, 4)

In [79]:
df.head()

          a         b         c         d
0  1.331587  0.715279 -1.545400 -0.008384
1  0.621336 -0.720086  0.265512  0.108549
2  0.004291 -0.174600  0.433026  1.203037
3 -0.965066  1.028274  0.228630  0.445138
4 -1.136602  0.135137  1.484537 -1.079805

In [80]:
df.tail()

          a         b         c         d
5 -1.977728 -1.743372  0.266070  2.384967
6  1.123691  1.672622  0.099149  1.397996
7 -0.271248  0.613204 -0.267317 -0.549309
8  0.132708 -0.476142  1.308473  0.195013
9  0.400210 -0.337632  1.256472 -0.731970

In [81]:
df.head(7)

          a         b         c         d
0  1.331587  0.715279 -1.545400 -0.008384
1  0.621336 -0.720086  0.265512  0.108549
2  0.004291 -0.174600  0.433026  1.203037
3 -0.965066  1.028274  0.228630  0.445138
4 -1.136602  0.135137  1.484537 -1.079805
5 -1.977728 -1.743372  0.266070  2.384967
6  1.123691  1.672622  0.099149  1.397996

In [82]:
df.tail(7)

          a         b         c         d
3 -0.965066  1.028274  0.228630  0.445138
4 -1.136602  0.135137  1.484537 -1.079805
5 -1.977728 -1.743372  0.266070  2.384967
6  1.123691  1.672622  0.099149  1.397996
7 -0.271248  0.613204 -0.267317 -0.549309
8  0.132708 -0.476142  1.308473  0.195013
9  0.400210 -0.337632  1.256472 -0.731970

In [83]:
df[['a', 'b']]

          a         b
0  1.331587  0.715279
1  0.621336 -0.720086
2  0.004291 -0.174600
3 -0.965066  1.028274
4 -1.136602  0.135137
5 -1.977728 -1.743372
6  1.123691  1.672622
7 -0.271248  0.613204
8  0.132708 -0.476142
9  0.400210 -0.337632

In [84]:
df.loc[[0, 1, 7], ['a', 'b']]

          a         b
0  1.331587  0.715279
1  0.621336 -0.720086
7 -0.271248  0.613204

In [85]:
df.loc[[0,5]]

          a         b        c         d
0  1.331587  0.715279 -1.54540 -0.008384
5 -1.977728 -1.743372  0.26607  2.384967

In [86]:
df

          a         b         c         d
0  1.331587  0.715279 -1.545400 -0.008384
1  0.621336 -0.720086  0.265512  0.108549
2  0.004291 -0.174600  0.433026  1.203037
3 -0.965066  1.028274  0.228630  0.445138
4 -1.136602  0.135137  1.484537 -1.079805
5 -1.977728 -1.743372  0.266070  2.384967
6  1.123691  1.672622  0.099149  1.397996
7 -0.271248  0.613204 -0.267317 -0.549309
8  0.132708 -0.476142  1.308473  0.195013
9  0.400210 -0.337632  1.256472 -0.731970

In [89]:
val=0
df>val

       a      b      c      d
0   True   True  False  False
1   True  False   True   True
2   True  False   True   True
3  False   True   True   True
4  False   True   True  False
5  False  False   True   True
6   True   True   True   True
7  False   True  False  False
8   True  False   True   True
9   True  False   True  False

In [90]:
df2=df[df>val]
df2

          a         b         c         d
0  1.331587  0.715279       NaN       NaN
1  0.621336       NaN  0.265512  0.108549
2  0.004291       NaN  0.433026  1.203037
3       NaN  1.028274  0.228630  0.445138
4       NaN  0.135137  1.484537       NaN
5       NaN       NaN  0.266070  2.384967
6  1.123691  1.672622  0.099149  1.397996
7       NaN  0.613204       NaN       NaN
8  0.132708       NaN  1.308473  0.195013
9  0.400210       NaN  1.256472       NaN

In [116]:
df3=df2.dropna() # dropna parameter inplace=True means data is altered
df3

          a         b         c         d
6  1.123691  1.672622  0.099149  1.397996

In [117]:
df4=df2.fillna(value=df.mean()) #dropna(axis=1)
df4

          a         b         c         d
0  1.331587  0.715279  0.352915  0.336523
1  0.621336  0.071268  0.265512  0.108549
2  0.004291  0.071268  0.433026  1.203037
3 -0.073682  1.028274  0.228630  0.445138
4 -0.073682  0.135137  1.484537  0.336523
5 -0.073682  0.071268  0.266070  2.384967
6  1.123691  1.672622  0.099149  1.397996
7 -0.073682  0.613204  0.352915  0.336523
8  0.132708  0.071268  1.308473  0.195013
9  0.400210  0.071268  1.256472  0.336523

In [118]:
df4['a'].pct_change()

0          NaN
1    -0.533387
2    -0.993093
3   -18.169581
4     0.000000
5     0.000000
6   -16.250539
7    -1.065571
8    -2.801093
9     2.015712
Name: a, dtype: float64

In [119]:
df4['a'].corr(df4['b']) # corelation

0.4861086517391018

In [120]:
df['a'].corr(df4['a'])

0.8401036760991307

In [121]:
df['a'].cov(df4['a']) # covariance

0.4627536954345508

In [122]:
data={'company': ['a', 'a', 'b', 'b', 'c', 'c'],
     'person': ['Manish', 'Yash', 'Somnath', 'Rupesh', 'Ankit', 'Fate'],
     'sales': [1000, 2000, 3000, 1000, 2000, 3000]}
data=pd.DataFrame(data)
data

  company   person  sales
0       a   Manish   1000
1       a     Yash   2000
2       b  Somnath   3000
3       b   Rupesh   1000
4       c    Ankit   2000
5       c     Fate   3000

In [123]:
comp=data.groupby('company').mean()
comp

          sales
company
a        1500.0
b        2000.0
c        2500.0

In [124]:
ans=data.groupby('company').sum()
ans.loc['b']

sales    4000
Name: b, dtype: int64

In [126]:
#data=pd.read_csv()